[{"url":"http://www.rodong.rep.kp/en/index.php?strPageID=SF01_02_01&newsID=2021-07-12-0003","imagePage":"index.php?strPageID=SF01_02_02&newsID=2021-07-12-0003_photo","images":[{"url":"http://www.rodong.rep.kp/article_contents_en/2021/07/12/photo/2021.07.12_page_1_image_0003.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/07/12/photo/2021.07.12_page_1_image_0004.jpg","height":"560"}],"title":"Respected Comrade Kim Jong Un Meets and Congratulates Creators and Artistes of Major Art Troupes","content":["Kim Jong Un, general secretary of the Workers' Party of Korea and president of the State Affairs of the Democratic People's Republic of Korea, Sunday met and congratulated the creators and artistes of the major art troupes on receiving state commendations.","The creators and artistes were overwhelmed by the feelings of profound reverence and gratitude to the great mentor and kind-hearted father who met them in person following the conferment of high honor and state commendations to them though they just did their part as persons of art and literature of the Party on the road of advance for implementing the decisions made at the historic Party Congress.","The respected General Secretary gave a pep-talk to them, warmly holding their hands one by one, in recognition of their distinguished services for the development of Juche music in the revolutionary traits of creation, keeping in mind the trust of the Party Central Committee and the expectation of the people.","He said with appreciation that they created and portrayed masterpieces of the times loved by the people including song \"Our National Flag\" true to our Party's revolutionary line and idea, and thus glorified our state-first era and instilled confidence and optimism about sure victory into the people.","He repeatedly expressed satisfaction, saying that it is something that has been craved for and which is worth welcoming before any other achievements that the Band of the State Affairs Commission has evoked positive responses and repercussions from the people with its art creation and performing activities marked by masterpieces and famous performances reflective of the intention of the Party Central Committee at a time when the field of art and literature is still in the dormancy and doldrums.","The new era of advance and dynamism demands the creation of lots of more influential and appealing masterpieces pulsating with the spirit of the times than ever before in the field of art and literature entrusted with important mission and innovative role to play in the revolution and construction, he emphasized.","Our art and literature are obliged to be responsive to the requirements of the Party's policies and the spirit of the times to make the Party's idea and will pervade the whole process of the creation and performing activities that conform to the people's mentality, he said, calling on the major art troupes to keep their honor and consolidate the achievements of creation and based on it give exceptionally high momentum to the creation in the overall art and literature field.","The respected General Secretary expressed the trust and expectation that they would continue to glorify their honor as the trumpeters of the revolution on the sacred road of singing of our great era, our great Party, our great state and our great social system, and had a meaningful photo taken with all the artistes of the Band as well as the decorated creators and artistes.","All the creators and artistes renewed their firm pledge to always share their intention and breath with the Party Central Committee, cherishing their honor and happiness all their lives, and to take the lead in opening the new era of efflorescence of socialist art and literature by waging more dynamic creation activities to imbue the whole society with our state-first spirit."],"byline":"Political News Team"},{"url":"http://www.rodong.rep.kp/en/index.php?strPageID=SF01_02_01&newsID=2021-07-08-0004","imagePage":"index.php?strPageID=SF01_02_02&newsID=2021-07-08-0004_photo","images":[{"url":"http://www.rodong.rep.kp/article_contents_en/2021/07/08/photo/01.jpg","height":"560"}],"title":"Respected Comrade Kim Jong Un Visits Kumsusan Palace of Sun on Greatest National Memorial Day","content":["All the people across the country are looking up to the supreme temple of Juche with boundless yearnings and in deep reverence for President Kim Il Sung on the occasion of the greatest memorial day of the nation.","Kim Jong Un, general secretary of the Workers' Party of Korea and president of the State Affairs of the Democratic People's Republic of Korea, visited the Kumsusan Palace of the Sun at 0:00 on Thursday.","Present there were members of the Political Bureau of the Central Committee of the Workers' Party of Korea (WPK) and the Party central leadership organ.","The palace where President Kim Il Sung and Chairman Kim Jong Il, founder and builders of our great Party and our powerful state, fathers of the nation and the great sages of revolution, lie in state was wrapped in solemn atmosphere.","A floral basket from the respected Comrade Kim Jong Un was placed at the statues of Kim Il Sung and Kim Jong Il.","Placed were floral baskets in the names of the WPK Central Committee, the State Affairs Commission of the DPRK, the Standing Committee of the Supreme People's Assembly of the DPRK and the Cabinet of the DPRK.","The respected General Secretary paid deep respects for Kim Il Sung and Kim Jong Il before their statues together with the participants.","At the halls where Kim Il Sung and Kim Jong Il lie in state the General Secretary made a bow of best wishes to the President and the Chairman who performed undying feats before the country, the people, the times and the revolution with their profound ideas and theories, extraordinary leadership ability and sweeping revolutionary practices.","The members of the Party central leadership organ made their firm pledge to fulfill their responsibility and duty as backbone of the Party and leading members of revolution in the present gigantic struggle for the progress and development of our style socialism, remaining faithful to the ideology and leadership of the respected General Secretary."],"byline":"Political News Team"},{"url":"http://www.rodong.rep.kp/en/index.php?strPageID=SF01_02_01&newsID=2021-06-30-0002","imagePage":"index.php?strPageID=SF01_02_02&newsID=2021-06-30-0002_photo","images":[{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/30/photo/01.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/30/photo/02.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/30/photo/03.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/30/photo/04.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/30/photo/05.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/30/photo/06.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/30/photo/07.jpg","height":"560"}],"title":"Report on Enlarged Meeting of 2nd Political Bureau of 8th C.C., WPK","content":["The current situation in which a fierce campaign is being conducted under the fighting programme set forth at the historic 8th Congress of the Workers' Party of Korea (WPK) to win a fresh victory in socialist construction despite all the manifold challenges calls for revolutionizing cadres, the backbone of the country, and strengthening their ranks with select ones by more clearly preserving the militant nature of our Party advancing in struggle.","The Political Bureau of the Party Central Committee convened an enlarged meeting at the office building of the Party Central Committee on June 29 to roundly deal with some leading officials' dereliction of duty in implementing the major policy tasks of the Party and the state, and to provide a fresh turning point in the personnel administration within the Party.","Kim Jong Un, general secretary of the WPK, guided the meeting.","Attending the meeting were members of the Presidium of the Political Bureau of the Party Central Committee, members and alternate members of the Political Bureau of the Party Central Committee, officials of the Party Central Committee, senior Party and administrative officials of ministries and national institutions, chief secretaries of the provincial Party committees, chairpersons of the provincial people's committees, chief secretaries of the city and county Party committees and industrial complexes and relevant officials of the armed forces organs and the state emergency anti-epidemic sector.","Prior to the discussion of agenda items, the respected General Secretary referred to the purpose of convening the enlarged meeting of the Political Bureau just after the plenary meeting of the Party Central Committee.","He mentioned that senior officials in charge of important state affairs neglected the implementation of the important decisions of the Party on taking organizational, institutional, material, scientific and technological measures as required by the prolonged state emergency epidemic prevention campaign associated with the worldwide health crisis, and thus caused a crucial case of creating a great crisis in ensuring the security of the state and safety of the people and entailed grave consequences.","He analyzed in the strong terms that a major factor braking and hindering the implementation of the important tasks discussed and decided at the Party congress and plenary meetings of the Party is the lack of ability and irresponsibility of cadres, and called for conducting a more fierce Party-wide campaign against ideological faults and all sorts of negative elements being exposed among the cadres.","He presented agenda items to be discussed at the current meeting, saying that the real aim of the meeting is to disclose all the main obstacles and stumbling blocks in the way of the advance of our Party and the revolution, issue an alarm warning to the real state of the ranks of cadres and open up a prelude to an intensive and continued Party-wide struggle.","The Political Bureau of the Party Central Committee unanimously approved the presented agenda items.","The enlarged meeting of the Political Bureau discussed as a major agenda item the issue of drawing a serious lesson from deeds detrimental to the Party revealed among leading officials of the Party and the state in implementing the decisions of the Party.","A data report was made at the meeting.","The report informed in detail about the dereliction of duty by some leading cadres who defaulted on carrying out the Party decisions and priority state tasks, betraying the great trust and expectation of all the Party members and people and falling short of bearing noble responsibilities and missions before the Party and the revolution.","And it sharply analyzed the gravity of their faults of not making strenuous efforts for the implementation of the decisions and instructions of the Party Central Committee, which are organizational intentions of the whole Party and its supreme orders, that require maximum circumspection, and of hampering the materialization of the Party's strategic plan, being seized with self-protectionism and passiveness and of bringing negative influence to stabilizing the people's living and the overall economic construction.","At the meeting sharp criticism was made of the cadres who revealed ignorance, disability and irresponsibility in implementing the major tasks discussed and decided at the plenary meetings of the Party Central Committee.","Members of the Party central leadership organ who made speeches analyzed and criticized with a keen political eye and on the Party principle the ideological root that caused poisonous aftermaths in realizing the plan and leadership of the Party Central Committee manifested by the senior cadres though they are obliged to unconditionally, thoroughly and devotedly implement the decisions made at the two Party plenary meetings which hold a key significance in firmly defending the authority of the historic congress of our Party and opening a sure prospect for carrying out the five-year plan.","They unanimously and severely pointed out that the senior cadres holding major posts of the Party and the state with the political trust and expectation from the Party Central Committee caused grave obstructions to the sustained consolidation of the state emergency epidemic prevention system on which hinges the security and future of the country and the people at present, and to the economic work of the country and stability of the people's living.","They hit out at the said cadres, branding their incapable and irresponsible work attitude of approaching the implementation of the state policies decided and issued by the Party plenary meeting in a distorted manner, as extreme negligence and deliberate idleness stemming from the lack of awareness and determination to throw themselves into resolving the afflictions of the Party and the state, not just simple business faults.","Learning a severe lesson that the self-protectionism, passiveness, subjectivity and arbitrariness of the officials are the main stumbling blocks hindering our advance and harming the interests of the Party and people, the participants in the meeting keenly felt once again the necessity to further strengthen the self-improvement and self-cultivation in the Party's spirit irrespective of positions.","At the meeting the data was informed about some officials in Pyongyang and other parts of the country who showed non-committal attitude and viewpoint on the Party's decisions and did not conduct the work assigned to them in a revolutionary way, being obsessed with defeatism. And a decision was approved on thoroughly examining and inspecting them in a Party and legal way and on taking relevant measures.","The respected General Secretary made an important conclusion.","Saying that the importance of the responsibility and role of senior officials including members of the Party central leadership organ and officials of units at all levels has become further salient after the 8th Congress of the Party, he referred to the necessity to put primary efforts into the work of building the ranks of cadres with select ones as the revolution advances and the situation gets grave, and to the major orientation of improving the cadres policy of our Party.","He expressed the opinion of the Party Central Committee concerning the seriousness of the acts alien to the Party revealed by the senior officials of the Party and the state.","He seriously pointed out that chronic irresponsibility and incompetence of cadres at present bring artificial difficulties to the implementation of the Party's policies and become a major brake doing tremendous harm to the development of the revolutionary work, stressing the need for the cadres to make increasingly exact demands on themselves and fulfill their responsibility and duty with high sense of extreme responsibility and practical ability.","He severely criticized the attitude of working like a flash in the pan, empiricism and old way of thinking generally revealed among cadres.","He said that if cadres do not make constant efforts to improve their political and practical qualifications and possess the revolutionary method and trait of work and if the Party organizations fail to strengthen the organizational control and education of cadres, it will result in weakening the traction power in implementing the decisions of the Party, let alone the correct implementation of the major policy tasks of the Party.","He said that benevolent politics and embracing policy our Party has held fast to since its foundation are not for cadres but for the ordinary working masses. He expressed the will to wage an offensive, ceaseless and strong struggle to rid the cadres of non-revolutionary fighting attitude, viewpoint and deeds, making it clear that the Party never reserves any right to cover those cadres who just pretend to work being only keen on maintaining their positions, not being sincerely solicitous for the country and the people.","He stressed the necessity to study and examine the Party's cadre policy again and also important problems based on the spirit of the current enlarged meeting of the Political Bureau.","Saying that now is the time to bring about a revolution in personnel administration before solving the acute economic problems, he noted that the revolution in cadre management which has always been regarded as of priority importance by our Party in the whole course of its development, is an important Party-wide task that has to be further intensified and strengthened on a priority basis to suit the current situation of our revolution.","He stressed the need to bring the system and method of personnel affairs in step with the needs of the developing reality, and called upon the cadres to continuously improve and temper themselves in a revolutionary way.","Saying that what is especially important is that cadres heighten their political awareness purposefully and consciously, he noted that if someone is a cadre, he or she has to be well aware of the Party's line and policy, correctly see through the situation and pending problems from the viewpoint of Party and the state and adopt the standpoint and work attitude of doing his or her part and striving for its implementation.","Noting that in order to raise the political awareness of the cadres it is necessary to strengthen refinement and tempering through Party life, he said that they have to honestly take part in the Party's organizational and ideological life, and improve and temper themselves in a revolutionary way, not just because they are monitored and asked to do by others, but for the Party and the revolution, for the high militant efficiency of their Party organizations and for their own political integrity.","Saying that Party's decisions are the organizational intentions and fighting programmes which illuminate the orientation of the advance of our revolution and that their implementation is weighed on cadres' shoulders, he called upon them to embody the revolutionary traits of thoroughly implementing the Party's decisions without fail.","Noting that what's taken note of by our Party in bringing about a revolution in the personnel affairs is the work style and moral traits, he said that all the cadres have to always bear in mind that our Party's prestige and image are mirrored in their work style and moral traits.","He put special stress on strengthening the ranks of cadres with select ones who are fully prepared in terms of loyalty, revolutionary spirit, popular spirit and competency at the Party organizations at all levels.","The meeting then dealt with an organizational issue.","It recalled and by-elected a member of the Presidium of the Political Bureau, members and alternate members of the Political Bureau of the Party Central Committee, recalled and elected a secretary of the Party Central Committee and transferred and appointed the cadres of the state organs.","The enlarged meeting of the 2nd Political Bureau of the 8th WPK Central Committee has become a significant occasion which demonstrated the invincible leadership ability and revolutionary discipline of our Party which is confidently opening up the period of a new upsurge of the revolution with greater fighting capacity and strenuous efforts despite manifold difficulties in the way of vigorous advance."],"byline":"Political News Team"},{"url":"http://www.rodong.rep.kp/en/index.php?strPageID=SF01_02_01&newsID=2021-06-22-0005","title":"Respected Comrade Kim Jong Un Sends Letter to Participants in Women's Union Congress","content":["The respected Comrade Kim Jong Un sent a letter \"Let the Women's Union Become a Powerful Unit in Propelling the Advance and Development of Our Style of Socialism\" to those attending the Seventh Congress of the Socialist Women's Union on June 20.","Following is its full text:","It is quite meaningful that the Seventh Congress of the Socialist Women's Union of Korea, a political organization of the masses of women of our country, is being convened immediately after the successful holding of the historic Third Plenary Meeting of the Eighth Central Committee of the Workers' Party of Korea.","The revolutionary enthusiasm and mettle of the people across the country are running higher now as they are greatly inspired by the decisions and special measures adopted at the plenary meeting, aimed at promoting our socialist construction more prudently and powerfully.","Hoping that this congress, held in the days when our socialist construction has entered an important phase, will constitute a turning point in understanding once again the position and duties of the women's movement of our country that has an important role to play in the revolution and in preparing the women's union members as revolutionaries faithful to the Party, as steadfast patriots, I extend warm congratulations to it in the name of the Party Central Committee.","Even in the unfavourable subjective and objective situations prevailing now, our style of socialism is achieving a steady advance and development and the strength of our state is being built up day after day, and all these are inconceivable separated from the loyal and patriotic minds of our women including the women's union members who are pushing ahead one of the two wheels of the revolution along the road to victory indicated by the Party.","Our women including the women's union members have entrusted their destiny entirely to the WPK, followed it both in good times and bad, and devoted themselves to adding further victory and glory to their socialist motherland. Their ennobling spiritual world and unyielding struggle is a source of great pride for our Party and people.","In the history of the unforgettable struggle over the past five years, in which our revolution has gone through another period of difficulties and training and made an enormous leap forward, they rendered an outstanding contribution to their country, fellow people and posterity with a burning patriotic passion.","The consecutive challenges and disasters that have befallen our state and people have imposed one burden after another on all families across the country in their living, but before thinking of their livelihood, our women including the women's union members, mindful of their sense of responsibility for the Party and the country, have done their utmost to support our socialist system and increase our country's strength.","While rendering assistance to the major fronts of socialist construction, they have performed feats of labour by volunteering to do difficult tasks and brought the beautiful morality and traits into full bloom in our great socialist family by overcoming the difficulties cheerfully. Their lofty minds and devoted efforts are imprinted in all the great successes and proud creations, symbolic of the self-respect and prosperity of our state.","And shouldering the heavy burdens of their families, they have supported their dear husbands and children to be faithful to the Party and the revolution and, in these days when their country is in difficulties, strived tenaciously to do one more thing for the benefit of the country; their sincerity has added strength to our revolution on its advance in the face of difficulties.","Every step our country has taken to attain the present strategic status recognized by the world and demonstrate its prestige and glory is associated with the devoted efforts and selfless support of our unyielding and pure-hearted women including the women's union members; the Party Central Committee will never forget their laudable deeds and beautiful minds.","Availing myself of this opportunity, I extend warm greetings of gratitude to all the Korean women for devoting all their sincerity for the prosperity and development of their country, for the bright future of their rising generations and for the unity and harmony of their society and families by braving difficulties, following our Party wholeheartedly.","It is the steadfast will of the Party Central Committee to take full responsibility for the lives and life of the people however severe the trials facing us are and advance with unflinching perseverance towards a fresh victory of socialism so as to provide our people including our women, who are the finest in the world, with a better future and a stabilized and happy life free from any worries.","Proceeding from this, the Third Plenary Meeting of the Eighth Central Committee of the WPK advanced crucial policies for promoting our socialist construction as quickly as possible in the harsh circumstances and adopted decisive measures for resolving the pressing problems, which our people, women in particular, are concerned with and wish to be resolved.","Today, when everything is arduous and challenging, all the people should be rallied behind the Party more firmly, and instead of harbouring vague hopes or expectation, they should cultivate indomitable fighting will and conviction and give free rein to the revolutionary spirit and the fighting mettle of self-reliance and fortitude unique to the Korean revolution. Then a prosperous and happy new era ushered in by the Eighth Congress of the WPK will surely arrive.","Women constitute a powerful force for the development of a state and society, and the future of families, society and, furthermore, a country is inconceivable separated from the roles played by them.","Only when our women, who make up half of the country's population, are united as one and give play to their spiritual strength and patriotism, can we increase our independent strength, our internal forces, of our revolution and accelerate the speed of socialist construction. This is why on today's revolutionary advance for a fresh upsurge and massive transformation in socialist construction our Party attaches great importance to the role of the women's union, a political organization of the masses of the Korean women and an organization for their ideological education.","In this pivotal period of our revolution, the women's union, by nature, must inject vitality into the advancing revolution and forcefully propel today's all-people advance by remarkably enhancing its fighting efficiency and rousing all its members to the implementation of the major decisions of the Party Congress and the Party Central Committee.","The central task facing the women's union organizations at present is to train all their members to be genuine revolutionaries and ardent patriots, who are fully prepared politically and morally and devote themselves to the socialist patriotic work.","The SWUK should fully demonstrate the strength of the women's movement of Korea by implanting the ideological and spiritual principle of loyalty and patriotism in all its members and giving the fullest play to their enthusiasm for the revolution.","The women's union organizations should first direct its great effort to the ideological work aimed at improving the level of political consciousness of their members.","This work is an essential and primary process in training them to be true revolutionaries, who work with devotion not only for the happiness of their own families but for the prosperity and development of their country, our great socialist family.","What is important in raising the level of political consciousness of the members of the women's union is to full imbue them with the Party's lines and policies.","The process of arming them with the Party's lines and policies, the guidelines of the revolution and construction, and mobilizing them to implement them is precisely the process of enhancing the political consciousness of the masses and transforming them along the revolutionary and communist lines.","Women's union organizations should promptly and accurately convey to their members the Party's lines and policies advanced at each period and explain their gist and contents in clear and plain terms. In this way they can instil in them the conviction that they can be stronger and better-off only when they do as required by the Party's policies.","In particular, they should make their members fully aware of the fighting objectives and struggle tasks set forth at the Party's Eighth Congress and the plenary meetings of the its Central Committee, as well as the major ideas which they must regard as the guidelines for their work and life. Doing this will help them clearly understand what is expected of them in the era of a new advance, an era of dynamic struggle.","It is important to conduct information and education work on the validity and vitality of the Party's policies in a true-to-life and persuasive manner and in combination with the reality. Then all the women's union members will keenly realize how great the affection, benevolence and benefit bestowed on them by the Party and the state, and exert themselves to live up to them.","Women's union organizations should not content themselves with informing their members of the Party's ideas and policies once or twice, but turn every occasion of their work with them into a process of rearming them with the Party's lines and policies.","They should help their members to widen their political vision by reading the Party's organ, magazine Korean Women and other revolutionary publications. They should encourage them to make reading the Party's organ Rodong Sinmun their everyday routine and habit and, by doing so, be fully aware of our Party's intentions and the reality which is seething with socialist construction. Korean Women should be edited in such a way that it can sensitively carry the Party's policies and what is essential for the education of women and what they want to know. Then the magazine will become politically significant and an excellent life companion welcomed by every woman.","It is important in raising the level of political consciousness of the women's union members to conduct ideological education of them in an aggressive way with the main emphasis on the five-point education.","Women's union organizations should turn all the opportunities and means for education including visits to the revolutionary battlefields and historic sites into occasions when their members improve their political consciousness while cultivating their loyalty to the Party, faith in the sure victory of revolution and ardent love for socialist country and developing their staunch class consciousness and communist traits.","Women's union members should be inspired to learn from the ennobling ideological and spiritual world and fighting spirit possessed by the preceding generations of our revolution. Inheriting their loyalty, revolutionary character, indomitable fighting spirit and noble traits is important for everyone of the current generation, but this is crucial for women in particular, who hold a more important position than anybody else in carrying forward the lifeline of their revolutionary families and the baton of the dignified powerful country.","They should be educated to learn the revolutionary spirit of the preceding generations and the value of the sweat and blood they shed. Then they will not remain onlookers who merely observe the developing times and reality within the narrow confines of their homes, but become genuine masters who propel the era of massive transformation and dependable cornerstones who carry forward their excellent family and national traits and support their country.","Women's union organizations should conduct ideological education among their members by using vivid historical materials so that they all can cherish deeply in their minds the faith that the priceless glory of life, the happiness of their families and offspring and the bright future of their country are assured when they follow the Party and the leader regarding them as their spiritual mainstay as the heroes and vanguards in the period of postwar reconstruction and the Chollima era did. They should inspire their members to devote heart and soul to the struggle to bring earlier the future of the prosperous and powerful country our Party plans to build, while comparing themselves with the preceding generations who built a socialist paradise resounding with the song We Are the Happiest in the World in a span of merely ten years after the war under the leadership of the great leader Comrade Kim Il Sung.","Second, women's union organizations should educate and guide their members to possess civilized and ennobling cultural and moral traits.","Women's cultural and moral traits are reflected in the lifestyle of the country and society and the traits of their posterity.","Women's union members and other women should always remember that only when they are culturally and morally beautiful and pure can the country be civilized, their families and society be sound and our future be bright.","They should be proactive in sustaining our own lifestyle, moral traits and beautiful manners and customs unique to our nation.","They should be encouraged to prefer to wear Korean traditional women's clothes, make their attire and personal appearance smart and refined as required by the aesthetic tastes of the times and manage their household affairs scrupulously, thereby making all the aspects of life brim over with our flavour, taste and national emotions.","They should make it a rule to always keep their houses, streets and villages cultured and neat and economize on everything. Women's union organizations should ensure that the movements for winning the titles of July 11 Red-flag Dong of Loyalty and July 11 Red-flag Neighbourhood Unit of Loyalty and for creating families exemplary in establishing a socialist cultured way of life do not become a businesslike work of sprucing them up, but a process for enhancing the level of civilization of their members and other women and cultivating among them the love for their home towns, families and future and the spirit of thrift.","It is the Korean women's excellent trait to observe good manners, promote harmony of their families, help others and strengthen friendly ties with their neighbours.","Women's union organizations should pay close attention to sustaining and developing these beautiful moral traits and good manners.","They should ensure that the ennobling human traits of our women find expression in respecting the revolutionary forerunners, their teachers and seniors and in voluntarily observing etiquette in speech and greetings and public decency.","They should see to it that all their members and other women advance hand in hand towards the bright morrow, upholding the communist slogan \"One for all and all for one!\" which epitomizes the spiritual and moral traits of our society. Our human relations should be forged by virtue of benevolence and tender feelings, regarding sacrificing oneself for others as a noble virtue and beautiful deed, and helping and supporting others sharing joy and sorrow with them. They should ensure that these relations become firm moral foundations of our society.","Women's union members and other women should be encouraged to value their families, cells of society, and make their homes happy places to live in.","Nobody can replace them in their role of supporting their husbands so that they will be faithful to the Party and revolution, bringing up their children into reliable pillars of socialist Korea and keeping their families amicable and harmonious.","Although there may be something insufficient in their family life, they, always mindful of their responsibilities as a homemaker, daughter-in-law, wife and mother, should care for their parents-in-law and exert themselves to support their husbands and children so that they creditably discharge their duties they have assumed before the state and society.","When all the women's union members and other women across the country become tender-hearted daughters-in-law, beloved wives, considerate mothers and kindly neighbours, our society will always be full of animation and vitality and our state will possess greater strength.","Women's union organizations should create a revolutionary climate of cultural and emotional life among their members to ensure that they lead a life full of optimism and emotion. They should organize various mass-based cultural activities such as dissemination of songs, group dancing, appreciation of literary and artistic works and recital of poems in consideration of our women's psychology characterized by rich emotion and love of arts. They should also hold regular sports and recreational games that suit their constitution and physical features. By doing so, they can ensure that the whole society brims with vigour and optimism by virtue of our women's happy laughter and cheerful and optimistic way of life.","The organizations should intensify the struggle against anti-socialist and non-socialist practices. They should bring home to their members the truth that such practices are harmful, poisonous weeds that spread the seeds of calamity over the cradle of their happiness and malignant tumor that threatens the life and future of themselves, their families and posterity, so that every one of them can detest and despise those practices. They should make sure that their members do not connive at the practices manifested in their surroundings, regarding them as something of no concern of theirs, but combat even the slightest manifestation then and there uncompromisingly by approaching them in the context of the future of our style of socialism and the life or death of themselves and their children. As a guardian of their members' political integrity, they should give a timely alarm to warn of the alien tendencies manifested in various aspects of life including their attire and speeches, and root them out through intense ideological education and struggle.","Third, women's union organizations should proactively organize and enlist all their members in the worthwhile patriotic work to exalt the brilliance of the era of the our-state-first principle.","Women's union members should be encouraged to conduct brisk motivational activities of various forms in the major theatres and production sites where fierce struggles are underway to implement the decisions of the Party Congress.","They should keep the working people's hearts ablaze with enthusiasm by means of revolutionary songs and stirring motivational speeches, help them with their work and offer various kinds of service at their breaks, thereby encouraging the combatants to perform creative labour feats.","They should contribute to building a prosperous country with their honest sweat and efforts.","Women's union shock brigade movement should be oriented to developing their own home towns and villages into model towns and ideal villages, in which socialist civilization is epitomized, and providing manpower support to the local factories, enterprises and cooperative farms. All the women's union members should devote themselves with a pure conscience and patriotic heart even if they have to plant a single tree and a single blade of grass.","They should be encouraged to turn out as one in good-conduct movements with a sense of civic duty and patriotic conscience.","Women's union organizations and their members should launch a wide range of good-conduct movements including silkworm and rabbit breeding and find out more tasks to contribute to the country in accordance with the features and actual situations of the local areas.","Women's union members should not neglect recycling of outdated and idle materials, but take an active part in it, regarding it as a patriotic undertaking to enrich the treasure house of the country.","Women's union organizations should scrupulously organize the work of publicizing the good experiences gained in the good-conduct movements and raise a hot wind of competition for learning from others and overtaking them.","Women's union members in the sector of commerce and public catering, mindful of their duties as faithful service workers for the people, should rack their brains to provide the people, who have thrown themselves heart and soul into implementing the decisions of the Party Congress, with as many benefits as possible, and be more meticulous and kindly in their service to save them any inconvenience.","When housewives join and work at housewives' workteams, it will contribute to improving the people's livelihood and housekeeping and will be conducive to training them in the spirit of collectivism.","Provinces, cities and counties should organize various types of such workteams in a rational way to increase the production of consumer goods and contribute to providing convenience to the people's living in line with the actual conditions of their areas, and actively involve housewives in them to run them briskly.","Women's union organizations should strengthen education and control lest their members fall into the deviation and selfish inclination of not participating in production activities in actuality after nominally registering their names in housewives' workteams, so that they can make a substantial contribution to creating public wealth through diligent labour.","They should scrupulously arrange the work of encouraging their members in working age to actively enter society.","An important purpose of making them do so is to train them to be patriotic working people who love their country and fellow people.","In our country there are many women who are working faithfully for the Party, country and people at their own posts, even though they may not be seen or appreciated. No one else will bring us happiness; when we all work with devotion for creation, we will enjoy a more bountiful and beautiful future and life.","Women's union organizations should encourage their members to learn from the women who have volunteered to work at schools in the mountain villages and branch schools on islands far away from their dear hometowns and the models of laudable traits who are adding lustre to their life after volunteering to work at difficult and labour-consuming posts including the socialist countryside, to which the Party appeals to go. It is necessary to implant in them the consciousness that to participate in public life is just the road to loyalty and patriotism to repay the favour bestowed on them by the Party and country that have brought them up and the road to happiness for the future of themselves and their descendants, so as to ensure that they volunteer for honourable workplaces of socialist construction.","As women's union members differ from one another in their careers, hobbies and level of knowledge, it is important to do the work of encouraging them to enter society with a methodology.","As they are familiar with the merits, fortes, aptitudes and abilities of their members, women's union organizations should keep in close touch with relevant organs so that they are assigned to the right posts. As women's union members get more active in participating in public life, relevant units should organize work carefully to provide them with proper working and living conditions.","Women's union organizations should make sure that their members assist the People's Army substantially.","Officers' wives, always being conscious of the trust of the Party that puts them forward as the \"eldest daughters-in-law\" of our Party and the \"cooks\" of the Supreme Headquarters, should fulfil their role as assistants of their husbands and also take warm care of the life of other soldiers with the mind of their eldest sisters-in-law and eldest sisters.","All the women's union members and other women should send letters to the service personnel, who are performing feats at the posts of national defence and the sites of grand socialist construction, by reflecting their kindred affection in order to give them strength and encouragement and assist them in all sincerity, and pay close attention to the life of war veterans, honoured disabled soldiers, the families of those fallen in action and the families of service personnel and take sincere care of them.","Fourth, women's union organizations should ensure that their members put their affection and heart and soul to educating and training their children in a revolutionary way.","As there is a good mother behind a good man, the personality of children greatly depends on the role of women, mothers.","Women's union members and other women should not forget that proper education of their children is not confined to the matter of carrying on a family line, but is the noblest revolutionary work of training the successors who will shoulder the future of the revolution. They should always pay close attention to their growth and development without relaxing their mind, thinking that there will be nothing wrong with them since the country has taken full charge of their education.","They should make their children aware of the benevolence of the Party and the socialist system and instil in them the spirit of loving the country from childhood, and cultivate among them the feeling of respect for their parents, seniors and teachers, love for their collective and mates, attachment to our own things and hatred towards injustice so that they can behave honestly at all times and in all places. In particular, it is needed to put them on the right track and guide them correctly at every step of their growth lest they should be infected with an alien ideology, culture and lifestyle in their childhood and youth when they are curious about anything and sensitive to the new.","Bearing in mind that every word and deed of parents is reflected on the minds of their children like in a mirror, women's union members and other women should make every occasion of their life serve as a good textbook and even a word they speak contain the noble mind that cares for the country and the people before their own families.","Spare the rod and spoil the child, a saying goes. They should always make exacting demands on their children and lead them along the right path, instead of indulging them with blind love, so that they can grow into true and staunch sons and daughters of the country.","Women's union members and other women, who are all mothers, should actively encourage their children to volunteer in high spirits for difficult and labour-consuming sectors and the sacred posts of national defence in response to the call of the times so that they can add lustre to their youth.","They should engrave in their own hearts the noble and warm maternal love cherished by the mothers of this country who, during the Fatherland Liberation War, pushed their beloved children without hesitation to take the path of sacred struggle for defending the country, the path along which they had to cross a sea of flames.","Women's union organizations should, on Children's Education Day and different other occasions, inform their members of matters relating to education at home, give prominence to those members who have brought up fine children before sending them to posts of national defence and those who are properly educating and supporting their children so that they can study hard, take an active part in their organizational life and devote their sincere sweat and efforts to performing their revolutionary tasks, and scrupulously organize the work of making others follow suit.","For women to give birth to many children and raise them is an important matter that has a bearing on the destiny of the country and the future of the nation. Women should regard it as a laudable deed for the country and nation and an expression of patriotism to bear a large number of children and raise them to be fine persons. It is necessary to foster a social climate of rendering active assistance and giving preferential treatment to these mothers and strengthen state supply measures for them as well.","It is the most important policy and supreme desire of our Party and state to create better conditions for the upbringing of our children.","The women's union, mindful of the intention of the Party in taking special measures for our children at the Third Plenary Meeting of its Eighth Central Committee, should pay special attention to improving the work of the nurseries and kindergartens and making the nurses and teachers concentrate on bringing up children with the love and affection of their parents.","The SWUK should strengthen the combat capability of its organizations in every way in order to fully discharge the historic mission and duties it has assumed for the times and the revolution.","The focus in this work should be directed to giving precedence to the internal work of the union.","It is of particular importance for those organizations, which embrace many housewives, to direct great efforts to the guidance of their organizational and ideological life. The women's union should eliminate the tendency of engrossing itself in the activities of shock brigade and public decency maintenance corps and in implementing the economic tasks, and concentrate on arranging and guiding the organizational life of its members.","Its organizations should establish discipline among their members so that they would respect their organization and strictly observe the organizational discipline. They should make their members enhance their sense of organization, approach the decisions of their organizations seriously and carry out the decisions faithfully with the awareness that they can cast in their lots with the Party and add glory to their political integrity only through their organization.","They should lead their members to intensify the study of the union Rules and conduct their organizational life strictly as required by the Rules and norms of the union.","They should under any circumstances hold the regular general membership meetings and union life review sessions on the set dates without fail, heighten their political and ideological level; in particular, they should make the union life review sessions a process of ideological cultivation and training, by which their members realize their mistakes, awaken themselves and correct the mistakes in the atmosphere of strong criticism.","They should give assignments to their members in accordance with their characteristics and help them carry out those assignments correctly so as to make the process of carrying out the assignments an important occasion for awakening them ideologically, strengthening the organizations and encouraging them to make contributions to social development.","They should make an effective use of the information, motivation and edification system established in the union, reinforce and readjust the forces of information and motivation work, and steadily intensify the ideological educational work so as to prevent a vacuum from being created in their members' ideological consciousness.","They should employ fresh, original and highly effective methods for ideological education. They should not simply relay the lecture plans and educational materials sent by organizations at higher echelons and make up numbers in ideological education, but conduct this work through the combination of various methods like amateur artistic performances, explanation and persuasion, public discussions, get-togethers for exchanging impressions and multimedia presentations in line with the characteristics of women who are emotional, tender-hearted and meticulous, so that every event can touch their heartstrings.","They should eliminate the tendency of exaggeration and beautification about the reality and self-praise in ideological education, and conduct the work truthfully so that their members can believe and accept the reality as it is and in a direct way so that they can clearly understand the Party's intentions.","The fighting efficiency of the women's union is precisely the fighting efficiency of its primary organizations. Only when the primary organizations are strengthened, can the whole of the women's union be strengthened, and only when the primary organizations are active in their work, can the whole of the union become vibrant.","The main link in the whole chain of strengthening the primary organizations is to improve the practical qualifications of their officials. However high their preparedness and enthusiasm may be, they cannot lead their organizations properly if their qualifications are low.","The Day of Primary Officials should be operated in an effective way, and their practical levels and qualifications raised by various forms and methods including workshops, experience swapping and question-and-answer sessions.","Officials of the central, provincial, city and county women's union committees should go down to primary organizations in a planned and regular way, and help their officials sincerely, teaching them in detail the methods of arranging and guiding the organizational life, and resolving problems facing them.","What is important now in strengthening the primary organizations of the women's union is to properly control the ranks of its members and improve the organizational life guidance system in keeping with the actual requirements of the reality. The Central Committee of the SWUK should resolve the problems of the membership and composition of its primary organizations in a reasonable way so that it can grasp the actual situations in these organizations in detail and strengthen its arrangement and guidance of the organizational life of its members. It should take measures to solve without delay the problem of those who are divorced from their organizations or have not registered with them. It should also take measures for readjusting the structural system and working system of its city and county committees and primary committees so as to facilitate the arrangement and guidance of the organizational and ideological life of their members.","The women's union, by giving priority to the work of improving the fighting efficiency of its primary organizations, should intensify the movement of winning the titles of Model Primary Women's Union Committee of Loyalty and Model Primary Women's Union Unit of Loyalty and arrange in a scrupulous way the work of creating models in this movement and propagating their experiences. By doing so, they can turn all the primary organizations into units, whose members are faithful to the Party, are firmly united with one another as comrades and carry out any task one by one with credit.","The key to strengthening the fighting efficiency of the women's union organizations is in intensifying the work with their members.","Their might is just the united efforts of their members, and it is only when they rally all their members around them and move their hearts that their fighting efficiency is doubled.","The women's union should define a correct orientation of its work so that all its officials can give priority to the work with its members.","The work with women's union members is the work to understand their minds and feelings. The officials' work with them can be effective only when they open their minds, learning their innermost thoughts and even the mental pains that others are not aware of.","To this end, the working methods and style of officials of the women's union should be improved. If they are not sincere in learning the inmost thoughts of the union members, but put on airs and overbearing attitude, thinking that they could solve all problems with exacting demands and control, the masses of women will not follow them. Officials and members of the union are all women and daughters of the Party alike. If there is anything special for officials of the union, it is the trust bestowed on them by the Party and their organization. They should remember at all times that this trust means political trust and request that they should take care of the members as warmly as mothers do their own married daughters, and prepare them into laudable revolutionaries.","They should show warm humanity in their work while maintaining fidelity to principle.","As there are not a few among the women's union members, who are suffering from difficult living conditions of their families, the union officials should take tender care of and lead all of such members with prudence and human feeling. When they help and encourage those who are suffering mental agony and various other difficulties and make sincere efforts for them like their own elder or younger sisters, they will open their hearts to their organization and follow it sincerely.","They should put efforts into the work with hard-core and model members so that each of them will educate and lead ten and ten a hundred, thus strengthening the ideological and volitional unity of the union ranks.","They should be well-informed if they are to do their work well with the union members. They should all be more sensitive to the Party's ideas than anyone else, and make efforts to be well-versed in the Party's lines and policies and acquire much more knowledge, broader understanding and higher cultural attainments.","Party organizations at all levels should attach importance to the work of the women's union organizations, providing them with constant care and steering their work well.","They should give substantial guidance to the women's union organizations so that they can correctly determine the central point and orientation of their work in compliance with the Party's intentions and positively push ahead with their work as suited to the characteristics of their members; in particular, they should pay special attention to enhancing their independent and creative capacities.","They should keep abreast of the work of the women's union organizations, solve problems in their work in time, and encourage them to be always in motion and play their role creditably.","Party organizations and government organs should never give women's union organizations in their relevant regions social and other burdensome tasks, regarding their members as spare labour force.","They should direct great efforts to building up the ranks of the women's union officials with the former soldiers and other women who are loyal to the Party, have noble traits, enjoy popularity and are enthusiastic in their work, and to improving their qualifications.","Respecting women is a laudable virtue of communists and a quality showcasing the level of civilization of a society. Party organizations should establish across society the atmosphere of loving, giving prominence to and helping them, and make sure that the policies adopted for women are implemented to the letter.","Today, the era of a fresh upsurge and massive transformation of our revolution requires all the women's union members to powerfully advance the era of a great change with the indomitable spiritual strength and patriotic devotion unique to the Korean women."],"byline":"I firmly believe that all those attending this congress and women's union organizations will bring about a substantial improvement in their work as required by the developing revolution so as to demonstrate the might of the women's union to the full by rallying all the union members around the Party more firmly and energetically arousing them to the struggle for socialist construction."},{"url":"http://www.rodong.rep.kp/en/index.php?strPageID=SF01_02_01&newsID=2021-06-20-0001","title":"Respected Comrade Kim Jong Un Watches Performance Given by Band of State Affairs Commission","content":["Kim Jong Un, general secretary of the Workers' Party of Korea (WPK) and president of the State Affairs of the Democratic People's Republic of Korea, watched a performance given by the Band of the State Affairs Commission, together with members of the Party central leadership organ.","As he entered the auditorium of the theater amid the welcome music, all the participants burst into stormy cheers of \"hurrah!\"","The members of the Party central leadership organ extended the warmest gratitude and the highest respect to the respected Comrade Kim Jong Un, a great revolutionary and benevolent father, who set forth practical action programmes to powerfully lead the all-people grand advance to new victory and provided momentous policies through his round-the-clock guidance for four consecutive days with his ardent love for the country, the revolution, the people and posterity.","Artistes of the Band of the State Affairs Commission sang high praises of the greatness of the Party Central Committee which indicates the most correct way at every important moment of socialist construction, opens up a broad avenue of development and prosperity and leads our state and people to the future of communism with confidence.","The performance was acclaimed by the audience for reflecting the fighting spirit of all the people determined to bring about a bigger victory by rallying close around the Party Central Committee with one mind with absolute trust in the respected General Secretary, the ever-victorious banner of our Party and revolution and the whole destiny of socialist Korea.","The respected General Secretary expressed thanks to the performers for supporting the success of the plenary meeting of the Party Central Committee and making all the audience harden their indomitable will to struggle with their unique and dynamic art performance.","Waving back to the enthusiastically cheering people, he expressed belief that the participants of the plenary meeting would bear deep in mind the ideals of \"The People Are God\", single-minded unity and self-reliance as their unshakable creed, become the genuine revolutionaries who strive for our great state and people and guarantee the brilliant implementation of the fighting programme of our Party with innovative work results.","The members of the Party central leadership organ were full of firm resolution and high enthusiasm to do their best to uphold the idea and leadership of the General Secretary and repay without fail the great trust and expectations of the General Secretary by implementing the decisions of the Party congress and the plenary meetings of the Party Central Committee in the most thorough and perfect way as if they have their work reviewed by the Party and the people every moment every day."],"byline":"Political News Team"},{"url":"http://www.rodong.rep.kp/en/index.php?strPageID=SF01_02_01&newsID=2021-06-19-0004","imagePage":"index.php?strPageID=SF01_02_02&newsID=2021-06-19-0004_photo","images":[{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/19/photo/01.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/19/photo/02.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/19/photo/03.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/19/photo/04.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/19/photo/05.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/19/photo/06.jpg","height":"560"}],"title":"3rd Plenary Meeting of 8th Central Committee of WPK Closes","content":["The 3rd Plenary Meeting of the 8th Central Committee of the Workers' Party of Korea (WPK) closed on June 18 after successfully wrapping up the discussion of the agendas as the millions of Party members, boundlessly inspired by the leadership of the great Party Central Committee, displayed their iron will to faithfully implement the important policies newly indicated by the Party.","The fourth-day sitting of the plenary meeting reviewed the organizational and ideological life of the members of the Party central leadership organ in the first half of the year 2021 as the seventh agenda.","First, data on the Party life of the members of the Party central leadership organ in the first half of the year were informed.","Listening to the data, the members of the leadership organ seriously looked back on their Party life in an all-round way with the remorse for failing to live up to the expectations of all the Party members and people who trust them as the cores of the WPK and expect them to strive to carry out the important tasks in a responsible manner.","The respected General Secretary Kim Jong Un pointed out one by one the serious problems revealed in the work and life of the members of the Party central leadership organ newly elected at the 8th Congress of the Party although they made solemn pledges before the Party and the people.","He taught in detail what readiness and work attitude the members of the leadership organ should take to fulfill their historic mission and how they should strive to cultivate themselves ideologically, spiritually, culturally and morally.","The General Secretary stressed the need for the members of the leadership organ to draw a serious lesson from defects revealed in the first half of the year, bear deep in mind again the ideals of \"The People Are God\", single-minded unity and self-reliance set forth at the Party congress with the plenary meeting as an occasion and redouble their efforts with higher awareness to fully discharge their responsibilities and duties.","He said that in order to do so, they should be genuine revolutionaries who thoroughly accept and implement without fail the decisions of the Party Central Committee in whatever difficult circumstances and devote themselves without hesitation to defending the true nature of the Party just like the preceding generations of the revolution.","He earnestly asked the members of the leadership organ to make every occasion of going among the people an important political work of deepening the kindred between the Party and the popular masses and giving confidence and encouragement to the people with a resolution to work heart and soul to bring benefits of socialist system ever closer to the people and with a commitment not to do anything that offends the interests of the people.","Saying that the people who should take the lead in making our Party fulfill its duty as the militant general staff of the revolution and making it the one serving the people are the members of the Party central leadership organ, he ardently called upon them to devote all their wisdom and passion to thoroughly carrying out the major policy tasks discussed and decided at the plenary meeting without an inch of deflection.","The plenary meeting discussed the organizational issue as the eighth agenda.","It recalled and by-elected members and alternate members of the Political Bureau of the Party Central Committee and members and alternate members of the Party Central Committee and dismissed and appointed senior officials of the state organ.","The General Secretary concluded the plenary meeting.","Saying that the plenary meeting was able to successfully perform its work and fulfill its historic and important duty thanks to the ardent participation and boundless responsibility of the members of the Party central leadership organ, he expressed thanks to all the members of the leadership organ for taking an active and sincere part in the discussion of the overall work of the Party and the state throughout the plenary meeting.","The General Secretary solemnly swore on behalf of the WPK Central Committee that the Party will surely break through head-on the difficulties lying in the way of the revolution in the indomitable fighting spirit and remain loyal to the revolutionary idea and cause of President Kim Il Sung and Chairman Kim Jong Il to the end without the slightest deviation whatever severer difficulties it may be confronted with in the future.","All the participants in the plenary meeting, extending boundless gratitude to the General Secretary who provided immortal guidelines and a powerful practical weapon for vigorously leading the Korean-style socialism to progress and development with his extraordinary wisdom, insight, ceaseless thinking and devotion and instilled firm confidence and unbounded inspiring power in all the Party members and the people, broke into stormy applause and enthusiastic cheers reflecting their pledge of loyalty to single-mindedly and devotedly uphold the General Secretary's idea and leadership.","The 3rd Plenary Meeting of the 8th Central Committee of the WPK held under the guidance of the respected General Secretary will be etched in the history of the Juche-oriented revolution as a historic meeting at which important decisions for the prosperity of the country and the people's wellbeing were made despite the severest adversity and as a significant one through which the ever-victorious leadership of the WPK resolutely opening up an era of fresh dynamic advance with strenuous efforts despite manifold difficulties in the way ahead was fully demonstrated."],"byline":"Political News Team"},{"url":"http://www.rodong.rep.kp/en/index.php?strPageID=SF01_02_01&newsID=2021-06-18-0001","imagePage":"index.php?strPageID=SF01_02_02&newsID=2021-06-18-0001_photo","images":[{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/18/photo/2021.06.18_page_1_image_0001.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/18/photo/2021.06.18_page_1_image_0002.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/18/photo/2021.06.18_page_1_image_0003.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/18/photo/2021.06.18_page_1_image_0004.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/18/photo/2021.06.18_page_1_image_0005.jpg","height":"560"}],"title":"Third-day Sitting of 3rd Plenary Meeting of 8th Central Committee of WPK Held","content":["The third-day sitting of the 3rd Plenary Meeting of the 8th Central Committee of the Workers' Party of Korea (WPK) continued on June 17 to confirm the fighting policies which would play the guiding role in further accelerating the historic advance of our Party and people for this year and practical tasks.","As the respected Comrade Kim Jong Un appeared at the meeting hall to mount the platform, all the participants raised thunderous cheers of \"Hurrah!\" for the General Secretary of the ever-victorious Party who has wisely led the plenary meeting to creditably perform its crucial discussion and to fulfill its historic guiding mission and role with all his thinking and efforts directed to the well-being and happiness of the state and the people.","At panel study and consultative meetings that continued in the wake of the second-day sitting, substantial and dynamic tasks to be carried out in the second half of the year and practical ways were fully discussed.","The plenary meeting examined constructive opinions that were put together and adopted with unanimous approval a resolution reflecting additional measures for thoroughly carrying out major state policy tasks for this year and a resolution on unconditionally fulfilling the grain production plan by concentrating efforts of the entire Party, the whole army and all the people on the farming for this year.","The plenary meeting discussed as the fourth agenda item the analysis of the present international situation and our Party's corresponding direction.","The respected General Secretary reviewed and assessed major changes taking place on the international political arena in recent days and the external environment of our revolution.","Especially he made detailed analysis of the policy tendency of the newly emerged U.S. administration toward our Republic and clarified appropriate strategic and tactical counteraction and the direction of activities to be maintained in the relations with the U.S. in the days ahead.","The General Secretary stressed the need to get prepared for both dialogue and confrontation, especially to get fully prepared for confrontation in order to protect the dignity of our state and its interests for independent development and to reliably guarantee the peaceful environment and the security of our state.","Clarifying the foreign policy stand and principles of the WPK and the DPRK government concerning the important international and regional matters and stressing the need to further enhance the strategic position and active role of our state and create favorable external climate on our own initiatives, the General Secretary called for sharply and promptly reacting to and coping with the fast-changing situation and concentrating efforts on taking stable control of the situation on the Korean peninsula.","The plenary meeting discussed as the fifth agenda item the issues to be settled before anything else in order to stabilize and improve the people's living under the present situation.","Saying that it is the most important principle maintained by the WPK and the state in their activities to provide the stable life to the people and timely solve their difficulties, the General Secretary detailed the actual situation of the people's living which he acquainted himself with through several consultative meetings and the measures for its substantial improvement.","He said the idea of the devoted service for the people's wellbeing which is set forth as the sacred one by our Party is the practical guideline and standard of behavior that calls for upholding the people with unconditional service bearing the responsibility for their lives and livelihood with all dedication to their interest in practice. He stressed that the Party should go deep among the people despite hardships, become their trusty mainstay, always find itself near them to share joy and sorrow with them and devote its all to the people's wellbeing.","He said it is the main point of the plenary meeting to take decisive enforcement measures for immediately solving the urgent matters most concerned and looked forward to by the people, delivering a special order that he personally inked with his sincerity to make even a small contribution to stabilizing the people's living.","All the participants in the plenary meeting supported and approved with enthusiastic applause the important determination and decision of the General Secretary reflective of his responsibility for the destiny and life of all the people of the country and the spirit of devoted service for them.","Discussed at the plenary meeting as the sixth agenda item was the issue of improving and bolstering the Party's childcare policy.","The General Secretary stressed that there is no more important revolutionary work than the work of bringing up children, the future of the country, to be strong and sound and that it is the most important policy and supreme cherished desire of our Party and state to provide more improved conditions of bringing them up even at the cost of huge sum of money.","Noting that it has to be the way of advance and development of our revolution to exert more sincerity to children even the condition becomes worse and to take dynamic steps forward towards the future of communism with the might of that love, he warmly said that if the children who are born and grow up on this land eat well and are raised healthily in good environment from their childhood, so much vibrant vitality and vim will overflow our society after 20 or 30 years and the national power of the Republic will grow and gain in strength.","Saying that the period of nursery and kindergarten is the most important age in the children's growth and development, he called for establishing it as a Party's policy to supply all the children across the country with nourishing food including dairy products at the state's expense and set forth detailed tasks and ways for realizing it.","He ardently said that all the officials should pay special attention to providing sufficient food to the children of nurseries and kindergartens with their real parents' affection and get their loyalty to the Party, revolution, motherland and the people verified with their tangible contribution to implementing the Party's childcare policy.","At the plenary meeting, the suggestion made by the General Secretary was discussed with strong impulse and excitement and a relevant resolution was adopted with full support and unanimous approval.","All the participants in the meeting took a firm pledge to thoroughly implement the important policies discussed and decided at the plenary meeting.","The meeting continues."],"byline":"Political News Team"},{"url":"http://www.rodong.rep.kp/en/index.php?strPageID=SF01_02_01&newsID=2021-06-17-0001","imagePage":"index.php?strPageID=SF01_02_02&newsID=2021-06-17-0001_photo","images":[{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/17/photo/001.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/17/photo/002.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/17/photo/003.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/17/photo/004.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/17/photo/005.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/17/photo/006.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/17/photo/007.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/17/photo/008.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/17/photo/009.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/17/photo/010.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/17/photo/011.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/17/photo/012.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/17/photo/013.jpg","height":"560"},{"url":"http://www.rodong.rep.kp/article_contents_en/2021/06/17/photo/014.jpg","height":"560"}],"title":"Second-day Sitting of 3rd Plenary Meeting of 8th Central Committee of WPK Held","content":["The second-day sitting of the 3rd Plenary Meeting of the 8th Central Committee of the Workers' Party of Korea (WPK) was held on June 16 amid exceptionally high fighting will of all the participants in the plenary meeting to bring about without fail remarkable development-oriented changes in the overall state work by thoroughly implementing major policy tasks for 2021, the first year for accomplishing the new five-year plan set forth by the Party Congress.","In the second-day sitting, sector panels were organized and study and consultative meetings were held to make detailed study and discussion to successfully push ahead with the fighting tasks for the second half of the year without any deviation on the basis of the review and analysis of the work in the first half of the year that were mentioned in the important concluding speeches made by the respected General Secretary Kim Jong Un in the first-day sitting of the plenary meeting.","Members of the Presidium of the Political Bureau of the WPK Central Committee and members of the Political Bureau of the WPK Central Committee guided the study and consultative meetings of panels.","The study and consultative meetings were held divided into panels of metal, railway transport, chemical industry, electricity, coal, machine industry, construction and building materials, light industry, agricultural industry, emergency anti-epidemic, the struggle against anti-socialist and non-socialist practices and the Party work. The participants studied the draft resolution to be suggested to the plenary meeting and confirmed the draft measures and planned figures of which scientific accuracy and practicality are guaranteed.","The plenary meeting continues."],"byline":"Political News Team"}]